	/******************** (C) COPYRIGHT  风驰嵌入式开发工作室 ********************
 * 文件名  ：iso_I2C_gpio.c
 * 描述    ：STM32F0-LED       
 * 实验平台：M0-ISO开发板
 * 库版本  ：V1.3.0
 * 作者    ：风驰 QQ:779814207/2366260464
 * 博客    ：
 * 淘宝    ：http://shop71177993.taobao.com/
 * 修改时间: 2014-12-15
**********************************************************************************/	
/**
  ******************************************************************************
  * @file    iso_I2C_gpio.c 
  * @author  Fengchi  Technology Team
  * @version V1.3.0
  * @date    15-December-2014
  * @brief   led
  ******************************************************************************
  * @attention
  * I2C1_SCL<----->PB6
  * I2C1_SDA<----->PB7
  ******************************************************************************
	*/
/*
	应用说明：
	在访问I2C设备前，请先调用 I2C_CheckDevice() 检测I2C设备是否正常，该函数会配置GPIO

*/

#include <stdio.h>
#include "iso_i2c_gpio.h"
#include "bsp_delay.h"

/*
*********************************************************************************************************
*	函 数 名: I2C_Delay
*	功能说明: I2C总线位延迟，最快400KHz
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
static void I2C_Delay(void)
{
	__IO uint8_t i;

	/*　
	 	下面的时间是通过安富莱AX-Pro逻辑分析仪测试得到的。
		CPU主频72MHz时，在内部Flash运行, MDK工程不优化
		循环次数为10时，SCL频率 = 205KHz 
		循环次数为7时，SCL频率 = 347KHz， SCL高电平时间1.5us，SCL低电平时间2.87us 
	 	循环次数为5时，SCL频率 = 421KHz， SCL高电平时间1.25us，SCL低电平时间2.375us 
        
    IAR工程编译效率高，不能设置为7
	*/
	for (i = 0; i < 10; i++);  //i =10 ,SCL 频率为100KHZ
}

/*
*********************************************************************************************************
*	函 数 名: I2C_Start
*	功能说明: CPU发起I2C总线启动信号
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void I2C_Start(void)
{
	/* 当SCL高电平时，SDA出现一个下跳沿表示I2C总线启动信号 */
	I2C_SDA_1();
	I2C_SCL_1();
	I2C_Delay();
	I2C_SDA_0();
	I2C_Delay();
	
	I2C_SCL_0();
	I2C_Delay();
}

/*
*********************************************************************************************************
*	函 数 名: I2C_Stop
*	功能说明: CPU发起I2C总线停止信号
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void I2C_Stop(void)
{
	/* 当SCL高电平时，SDA出现一个上跳沿表示I2C总线停止信号 */
	I2C_SDA_0();
	I2C_SCL_1();
	I2C_Delay();
	I2C_SDA_1();
	I2C_Delay();
}

/*
*********************************************************************************************************
*	函 数 名: I2C_SendByte
*	功能说明: CPU向I2C总线设备发送8bit数据
*	形    参：_ucByte ： 等待发送的字节
*	返 回 值: 无
*********************************************************************************************************
*/
void I2C_SendByte(uint8_t _ucByte)
{
	uint8_t i;

	/* 先发送字节的高位bit7 */
	for (i = 0; i < 8; i++)
	{		
		if (_ucByte & 0x80)
		{
			I2C_SDA_1();
		}
		else
		{
			I2C_SDA_0();
		}
		I2C_Delay();
		I2C_SCL_1();
		I2C_Delay();	
		I2C_SCL_0();
		if (i == 7)
		{
			 I2C_SDA_1(); // 释放总线
		}
		_ucByte <<= 1;	/* 左移一个bit */
		I2C_Delay();
	}
}

/*
*********************************************************************************************************
*	函 数 名: I2C_ReadByte
*	功能说明: CPU从I2C总线设备读取8bit数据
*	形    参：无
*	返 回 值: 读到的数据
*********************************************************************************************************
*/
uint8_t I2C_ReadByte(void)
{
	uint8_t i;
	uint8_t value;
	
	/* 读到第1个bit为数据的bit7 */
	value = 0;
	for (i = 0; i < 8; i++)
	{
		value <<= 1;
		I2C_SCL_1();
		I2C_Delay();
		if (I2C_SDA_READ())
		{
			value++;
		}
		I2C_SCL_0();
		I2C_Delay();
	}
	return value;
}

/*
*********************************************************************************************************
*	函 数 名: I2C_WaitAck
*	功能说明: CPU产生一个时钟，并读取器件的ACK应答信号
*	形    参：无
*	返 回 值: 返回0表示正确应答，1表示无器件响应
*********************************************************************************************************
*/
uint8_t I2C_WaitAck(void)
{
	uint8_t re;
	
	I2C_SDA_1();	/* CPU释放SDA总线 */
	I2C_Delay();
	I2C_SCL_1();	/* CPU驱动SCL = 1, 此时器件会返回ACK应答 */
	I2C_Delay();
	if (I2C_SDA_READ())	/* CPU读取SDA口线状态 */
	{
		re = 1;
	}
	else
	{
		re = 0;
	}
	I2C_SCL_0();
	I2C_Delay();
	return re;
}

/*
*********************************************************************************************************
*	函 数 名: I2C_Ack
*	功能说明: CPU产生一个ACK信号
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void I2C_Ack(void)
{
	I2C_SDA_0();	/* CPU驱动SDA = 0 */
	I2C_Delay();
	I2C_SCL_1();	/* CPU产生1个时钟 */
	I2C_Delay();
	I2C_SCL_0();
	I2C_Delay();
	I2C_SDA_1();	/* CPU释放SDA总线 */
}

/*
*********************************************************************************************************
*	函 数 名: I2C_NAck
*	功能说明: CPU产生1个NACK信号
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void I2C_NAck(void)
{
	I2C_SDA_1();	/* CPU驱动SDA = 1 */
	I2C_Delay();
	I2C_SCL_1();	/* CPU产生1个时钟 */
	I2C_Delay();
	I2C_SCL_0();
	I2C_Delay();	
}

/*
*********************************************************************************************************
*	函 数 名: I2C_Probe
*	功能说明: 检测I2C总线是否被占用
*	形    参：无
*	返 回 值: 0：总线空闲； 1：总线占用；2：无效状态
*********************************************************************************************************
*/
E_I2C_BUS_STATE I2C_Probe(void)
{
	if (I2C_SDA_READ() && I2C_SCL_READ())
	{
		return I2C_BUS_IDEL;
	}
	else if((!I2C_SDA_READ()) && I2C_SCL_READ())
	{
		return I2C_BUS_BUSY;
	}
	else
	{
		return I2C_BUS_INVALID; //SCL时钟信号为低电平，数据线状态不稳定
	}
}

/*
*********************************************************************************************************
*	函 数 名: I2C_Bus_Free
*	功能说明: 释放I2C总线
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void I2C_Bus_Free(void)
{
	/*
	每次I2C主设备复位后，如果检测到SDA数据线被拉低，则控制I2C中的SCL时钟线产生9个时钟脉冲
	(针对8位数据的情况，“9个clk可以激活”的方法来自NXP的文档，NXP（Philips）作为I2C总线的鼻祖，这样的说法是可信的)，
	这样I2C从设备就可以完成被挂起的读操作，从死锁状态中恢复过来。
	*/
	uint8_t i = 0;
	for(i=0; i<9; i++)
	{
		I2C_SCL_0();
		I2C_Delay();
		I2C_SCL_1();
		I2C_Delay();	
	}
}

/*
*********************************************************************************************************
*	函 数 名: I2C_GPIO_Config
*	功能说明: 配置I2C总线的GPIO，采用模拟IO的方式实现
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void I2C_GPIO_Config(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	RCC_AHBPeriphClockCmd(I2C_RCC_PORT, ENABLE);
	
	GPIO_InitStructure.GPIO_Pin = I2C_SCL_PIN | I2C_SDA_PIN;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_Level_3;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;	//电路外部有上拉电阻，故这里不需要上拉; 若外部没有，需要配置上拉
	GPIO_Init(I2C_GPIO_PORT, &GPIO_InitStructure);

	GPIO_SetBits(I2C_GPIO_PORT, I2C_SCL_PIN | I2C_SDA_PIN);
	/* 给一个停止信号, 复位I2C总线上的所有设备到待机模式 */
	I2C_Stop();
	
	printf("I2c gpio config over! \r\n");
	/*SCL产生一个低电平，让XMF芯片恢复SDA数据线状态*/
	if(I2C_Probe() == I2C_BUS_BUSY)
	{
		printf("I2c bus busy, need free! \r\n");
		I2C_Bus_Free();
	}
}

/*
*********************************************************************************************************
*	函 数 名: I2C_CheckDevice
*	功能说明: 检测I2C总线设备，CPU向发送设备地址，然后读取设备应答来判断该设备是否存在
*	形    参：_Address：设备的I2C总线地址
*	返 回 值: 返回值 0 表示正确; 返回1表示未探测到或者总先忙; 返回2表示数据总线状态不稳定，SCL为低电平。
*********************************************************************************************************
*/
uint8_t I2C_CheckDevice(uint8_t _Address)
{
	uint8_t ucAck=0;
	E_I2C_BUS_STATE i2cState;
	
	i2cState = I2C_Probe();
	if(i2cState == I2C_BUS_IDEL) /* 判断I2C总线是空闲状态 */
	{
		printf("i2c bus I2C_BUS_IDEL\r\n");
		I2C_Start();		/* 发送启动信号 */

		/* 发送设备地址+读写控制bit（0 = w， 1 = r) bit7 先传 */
		I2C_SendByte(_Address | I2C_WR);
		ucAck = I2C_WaitAck();	/* 检测设备的ACK应答 */

		I2C_Stop();			/* 发送停止信号 */
		
		return ucAck;
	}
	else 
	{	
		printf("i2c bus I2C_BUS_BUSY,INVAL! \r\n");		
		return i2cState;
	}
}
